app/controllers/electives_controller.rb

SELECT "electives".* FROM "electives"  ORDER BY "electives"."created_at" DESC
---
	def index
		@electives = Elective.order(created_at: :desc).all

SELECT  "electives".* FROM "electives" WHERE "electives"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@electives=Elective.find(params[:id])

INSERT INTO "electives" ("course_name", "course_proposer_name", "course_instructor_name", "credits", "semester", "course_description", "text_and_references", "syllabus", "notes_t", "notes", "assignments_t", "projects", "projects_t", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@new_elective = Elective.new(elective_params)
		if @new_elective.save

SELECT  "electives".* FROM "electives" WHERE "electives"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@electives=Elective.find(params[:id])

SELECT  "electives".* FROM "electives" WHERE "electives"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "electives" SET "course_proposer_name" = ?, "updated_at" = ? WHERE "electives"."id" = ?  [["course_proposer_name", "aaa"], ["updated_at", "2019-01-03 09:44:06.224229"], ["id", 1]]
---
	def update
		@electives=Elective.find(params[:id])
		if @electives.update_attributes(elective_params)

SELECT  "electives".* FROM "electives" WHERE "electives"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "electives" WHERE "electives"."id" = ?  [["id", 1]]
---
	def destroy
		@elective=Elective.find(params[:id])
		@elective.destroy