app/controllers/posts_controller.rb

	def new
		@electives=Elective.find(params[:id])
---
SELECT  "electives".* FROM "electives" WHERE "electives"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@new_post = Post.new(post_params)
		if @new_post.save
---
INSERT INTO "posts" ("comments", "elective_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comments", "hello"], ["elective_id", 1], ["created_at", "2019-01-02 13:54:27.248449"], ["updated_at", "2019-01-02 13:54:27.248449"]]